{
  "popular": [
    {
      "id": "1",
      "title": "Сара Джио: Из Лондона с любовью",
      "autor": "Сара Джио",
      "autorEN": "Sara Gio",
      "name": "Из Лондона с любовью",
      "nameEN": "From London with Love",
      "genre": "popular",
      "annotation": "Аннотация к книге \"Из Лондона с любовью\"",
      "description": "Новый роман Сары Джио - это семейные тайны, любовные откровения и судьбоносные решения. Книжный магазин, полученный в наследство, перевернет страницу новой истории.",
      "fullDescription": "Наши дни. Валентина узнает, что ее мать Элоиза оставила ей в наследство дом в Лондоне. Отношения с матерью у Валентины разладились уже давно, поэтому она не заинтересована в наследстве. Но обнаруживается, что в доме находится книжный магазин, рядом живут симпатичные соседи и у Элоизы была от дочери тайна, которую Валентина начинает разгадывать, находя от матери многозначительные подсказки.1968 год. Элоиза делит съемную квартиру с подругой и мечтает открыть книжный магазин. Однажды она знакомится с Эдвардом - как ей кажется, очень приятным, но загадочным молодым человеком. Увы, после одной из встреч Эдвард исчезает. Это становится поворотным моментом в судьбе Элоизы, о чем поначалу не подозревает даже она сама.",
      "img": "https://img3.labirint.ru/rc/8503dffbaa892891f860363848bfe000/363x561q80/books99/988981/cover.jpg?1703262392",
      "rating": ""
    },
    {
      "id": "2",
      "title": "Х. Карлтон: Преследуя Аделин. Специальное издание",
      "autor": "Х. Карлтон",
      "autorEN": "H. Carlton",
      "name": "Преследуя Аделин. Специальное издание",
      "nameEN": "Pursuing Adeline. Special Edition",
      "genre": "popular",
      "annotation": "Аннотация к книге \"Преследуя Аделин. Специальное издание\"",
      "description": "Я могу манипулировать эмоциями любого, кто мне это позволит. Я заставлю вас страдать, заставлю вас плакать, заставлю вас смеяться и вздыхать. Но мои слова на него не действуют. Особенно тогда, когда я умоляю его уйти. Он всегда рядом, наблюдает и ждет. И я просто не могу отвести взгляд. Тогда, когда хочу, чтобы он был ближе ко мне.",
      "fullDescription": "Я не планировал влюбляться. Но теперь я не могу смотреть по сторонам. Я загипнотизирован ее улыбкой, ее глазами и тем, как она двигается. Как она раздевается... Я буду продолжать наблюдать и ждать. Пока не смогу сделать ее своей женой. И как только она согласится, я никогда ее не отпущу.Даже тогда, когда она будет умолять меня об этом.",
      "img": "https://img4.labirint.ru/rc/58e19fd9ee9be96fbe875fabbc3b9179/363x561q80/books101/1002316/cover.jpg?1706336763",
      "rating": ""
    },
    {
      "id": "3",
      "title": "Рада Джонс: Милосердие",
      "autor": "Рада Джонс",
      "autorEN": "Rada Johns",
      "name": "Милосердие",
      "nameEN": "Mercy",
      "genre": "popular",
      "annotation": "Аннотация к книге \"Милосердие\"",
      "description": "В отделении врача неотложки Эммы Стил пациенты мрут как мухи. Только что человек дышал и даже шел на поправку - и вот сердце уже не бьется. Руководство больницы в панике, под подозрением оказываются все сотрудники, начиная с Эммы, которая имела отношение к каждому из необъяснимых случаев смерти.",
      "fullDescription": "Взаимные обвинения и страх превращают коллег во врагов, а героиня вскоре теряет не только друзей, но и работу: заведующую отстраняют от должности. Когда на кону сама жизнь, сумеет ли Эмма в одиночку одолеть зло и спасти тех, кого любит, или монстр уничтожит и ее?",
      "img": "https://img4.labirint.ru/rc/d56c7726ed0f2dc25b80ef31a4d77591/363x561q80/books86/853486/cover.png?1690950303",
      "rating": ""
    },
    {
      "id": "4",
      "title": "Анна Джейн: Северная корона. Дилогия в одном томе",
      "autor": "Анна Джейн",
      "autorEN": "Anna Jane",
      "name": "Северная корона. Дилогия в одном томе",
      "nameEN": "Northern Crown. Dilogy in One Volume",
      "genre": "popular",
      "annotation": "Аннотация к книге \"Северная корона. Дилогия в одном томе\"",
      "description": "Уникальное коллекционное издание для всех фанатов Анны Джейн, одного из самых популярных авторов современных молодежных романов. Ее книги - это истории о любви и романтике, о дружбе и доброте, о мечтах и поиске себя. Художественное оформление книги, прекрасные иллюстрации Анны Крымовой и цветной обрез делают ее по-настоящему удивительной Дилогия \"Северная корона\" в новом подарочном издании!",
      "fullDescription": "",
      "img": "https://img3.labirint.ru/rc/d5e40c3588243cf08839112d26c66195/363x561q80/books100/996559/cover.jpg?1705731927",
      "rating": ""
    },
    {
      "id": "5",
      "title": "Григорий Кружков: Записки переводчика-рецидивиста",
      "autor": "Григорий Кружков",
      "autorEN": "Grigory Kruzhkov",
      "name": "Записки переводчика-рецидивиста",
      "nameEN": "Notes of a Recidivist Translator",
      "genre": "popular",
      "annotation": "Аннотация к книге \"Записки переводчика-рецидивиста\"",
      "description": "Григорий Кружков - поэт и переводчик, литературный критик и эссеист, лауреат престижных литературных премий, профессор РГГУ и почетный доктор словесности Дублинского университета. Всякий хороший переводчик - исследователь, влюбленный в чужое слово. Любимые поэты есть у каждого из нас, но совершить путешествие по пяти векам зарубежной поэзии, преодолеть грозные рифы непереводимостей и не застрять в тяжелых льдах и торосах словарей - такое удается не каждому. Григорию Кружкову это удалось. Неуемная тяга к открытиям уводила его далеко, к островам, на которых правили и приносили жертвы Аполлону его любимые поэты: Джон Китс и Льюис Кэрролл, Роберт Фрост и Уильям Йейтс, Джон Донн и Эмили Дикинсон. Все увиденное и испытанное в этом литературном путешествии требовало запечатления. В результате получился захватывающий рассказ о переводческой жизни, ее комедиях и драмах, о тайнах ремесла, любимых поэтах и переводчиках",
      "fullDescription": "Помещенная в приложении мини-антология избранных переводов автора, напечатанных параллельно с оригиналами, дает возможность пытливому читателю познакомиться ближе с удивительным миром на границе \"своего и чужого\" и самостоятельно поразмышлять над метаморфозами перевода. Книга иллюстрирована портретами и фрагментами рукописных текстов переводимых поэтов, рисунками из первых книжных изданий, а также репродукциями произведений искусства, восстанавливающих культурный контекст времени.",
      "img": "https://img4.labirint.ru/rc/e9f01bb55bd71e82cff82ca3e500411f/363x561q80/books97/968718/cover.png?1697772378",
      "rating": ""
    },
    {
      "id": "6",
      "title": "Катарина Масетти: Парень с соседней могилы",
      "autor": "Катарина Масетти",
      "autorEN": "Katarina Masetti",
      "name": "Парень с соседней могилы",
      "nameEN": "Boy from the Neighboring Grave",
      "genre": "popular",
      "annotation": "Аннотация к книге \"Парень с соседней могилы\"",
      "description": "Роман известной шведской писательницы Катарины Масетти \"Парень с соседней могилы\" был напечатан тиражом почти полмиллиона экземпляров и экранизирован.",
      "fullDescription": "Герои романа - простой фермер и городская интеллектуалка с утонченным вкусом - познакомились на кладбище у могил своих близких. Он от зари до зари вкалывает на ферме, она любит оперу и не пропускает театральных премьер. Может ли у них быть что-нибудь общее, кроме секса? Как долго продлится эта связь? И все же судьба не позволяет им расстаться",
      "img": "https://img3.labirint.ru/rc/d9e8d45a60c7e115f825ca3448e614ae/363x561q80/books84/838053/cover.png?1644938715",
      "rating": ""
    }
  ],
  "programming": [
    {
      "id": "7",
      "title": "Брюс Эккель: Философия Java",
      "autor": "Брюс Эккель",
      "name": "Философия Java",
      "genre": "programming",
      "annotation": "Аннотация к книге \"Философия Java\"",
      "description": "Впервые читатель может познакомиться с полной версией этого классического труда, который ранее на русском языке печатался в сокращении. Книга, выдержавшая в оригинале не одно переиздание, за глубокое и поистине философское изложение тонкостей языка Java считается одним из лучших пособий для программистов. Чтобы по-настоящему понять язык Java, необходимо рассматривать его не просто как набор неких команд и операторов, а понять его \"философию\", подход к решению задач, в сравнении с таковыми в других языках программирования. На этих страницах автор рассказывает об основных проблемах написания кода: в чем их природа и какой подход использует Java в их разрешении. Поэтому обсуждаемые в каждой главе черты языка неразрывно связаны с тем, как они используются для решения определенных задач. 4-е издание, полное.",
      "fullDescription": "",
      "img": "https://img3.labirint.ru/rc/a4ba45f6281ff3ea4115508ae1cad089/363x561q80/books47/464095/cover.jpg?1685121935",
      "rating": ""
    },
    {
      "id": "8",
      "title": "Адитья Бхаргава: Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих",
      "autor": "Адитья Бхаргава",
      "name": "Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих",
      "genre": "programming",
      "annotation": "Аннотация к книге \"Грокаем алгоритмы. Иллюстрированное пособие для программистов и любопытствующих\"",
      "description": "Алгоритмы - это всего лишь пошаговые алгоритмы решения задач, и большинство таких задач уже были кем-то решены, протестированы и проверены. Можно, конечно, погрузится в глубокую философию гениального Кнута, изучить многостраничные фолианты с доказательствами и обоснованиями, но хотите ли вы тратить на это свое время? Откройте великолепно иллюстрированную книгу и вы сразу поймете, что алгоритмы - это просто. А грокать алгоритмы - это веселое и увлекательное занятие.",
      "fullDescription": "",
      "img": "https://img4.labirint.ru/rc/b946e9c763b40310ede798fe75b10456/363x561q80/books58/571060/cover.jpg?1685121970",
      "rating": ""
    },
    {
      "id": "9",
      "title": "Джозеф Албахари: C# 9.0. Справочник. Полное описание языка",
      "autor": "Джозеф Албахари",
      "name": "C# 9.0. Справочник. Полное описание языка",
      "genre": "programming",
      "annotation": "Аннотация к книге \"C# 9.0. Справочник. Полное описание языка\"",
      "description": "В новом издании бестселлера читателю предлагаются все необходимые ответы на разнообразные вопросы по языку C# 9.0 и .NET 5. C# - это язык с замечательной гибкостью и широким размахом, но такое его непрекращающееся развитие означает, что по-прежнему есть многие вещи, которые предстоит изучить. В соответствии с традициями справочников O'Reilly это основательно обновленное издание будет наилучшим однотомным источником информации по языку C#, из доступных на сегодняшний день.",
      "fullDescription": "Организованное вокруг концепций и сценариев использования, новое издание книги снабдит программистов средней и высокой квалификации лаконичным планом получения глубоких знаний по C# и .NET.",
      "img": "https://img3.labirint.ru/rc/bfd407a44911d1b67174b96cb2b90b61/363x561q80/books82/817643/cover.jpg?1629127800",
      "rating": ""
    },
    {
      "id": "10",
      "title": "Мартин Фаулер: Рефакторинг кода на JavaScript. Улучшение проекта существующего кода",
      "autor": "Мартин Фаулер",
      "name": "Рефакторинг кода на JavaScript",
      "genre": "programming",
      "annotation": "Аннотация к книге \"Рефакторинг кода на JavaScript. Улучшение проекта существующего кода\"",
      "description": "Рефакторинг уже давно и прочно занимает достойное место среди технологий программирования, и не в последнюю очередь благодаря Мартину Фаулеру - автору одной из тех книг, которые написаны \"на все времена\". Сам принцип рефакторинга прост: это последовательность небольших шагов, таких как перемещение поля из одного класса в другой, вынесение фрагмента кода из метода и его превращение в самостоятельный метод или даже перемещение кода по иерархии классов. Каждый такой шаг выглядит настолько просто и естественно, что кажется удивительным - о чем здесь можно писать? Однако кумулятивный эффект от таких малых изменений состоит в существенном улучшении архитектуры существующего кода.Мартин Фаулер и другие высококлассные специалисты в области объектно-ориентированного программирования, принявшие участие в написании этой книги, изложили принципы и наиболее эффективные методики выполнения различных рефакторингов и показали, когда и как следует изучать код с целью его улучшения. В книге подробно описано более 60 методов рефакторинга, причем с практическими примерами на языке программирования JavaScript. Применение JavaScript и описание \"рефакторинга без классов\" является одним из отличий нового издания книги от старого.",
      "fullDescription": "Если первое издание книги можно было сравнить с хорошим вином, которое со временем становится только ценнее, то второе издание можно сравнить с шампанским - идеи в книге опьяняют, а их изложение искрится и играет… Это издание классической книги достойно того, чтобы занять свое место на книжной полке каждого серьезного программиста - вне зависимости от используемого языка программирования. Более двадцати лет опытные программисты во всем мире использовали книгу Мартина Фаулера Рефакторинг, когда им нужно было улучшить проект существующего кода, повысить удобство сопровождения программного обеспечения или облегчить понимание существующего кода. Это - такое долгожданное - новое издание было полностью обновлено, чтобы отразить важные изменения в области программирования. Второе издание книги содержит обновленный каталог рефакторингов и включает примеры кода на JavaScript, а также новые функциональные примеры, демонстрирующие рефакторинг без классов. Как и в первом издании, здесь объясняется, что такое рефакторинг, почему вы должны прибегать к рефакторингу, как распознать код, который нуждается в рефакторинге, и как успешно его провести независимо от того, какой язык программирования вы используете. Основные темы книги. Понимание процесса и общих принципов рефакторинга. Быстрое применение полезных рефакторингов для облегчения понимания и изменения программ. Распознавание запаха в коде, который сигнализирует о возможном применении рефакторинга. Каталог рефакторингов с объяснениями, мотивацией, техникой применения и простыми примерами Создание надежных тестов для рефакторингов Компромиссы и препятствия на пути рефакторинга Об авторе Мартин Фаулер - главный научный сотрудник компании ThoughtWorks. Он называет себя \"автором, докладчиком, консультантом и просто человеком, болтающим о разработке программного обеспечения\". Фаулер занимается разработкой программного обеспечения для предприятий, изучая, что делает проект хорошим, и какие методы необходимо применять для его создания.",
      "img": "https://img4.labirint.ru/rc/cf2eede385420104c2ad8b4ca8e9ea5d/363x561q80/books72/713014/cover.jpg?1566303955",
      "rating": ""
    },
    {
      "id": "11",
      "title": "Грофф, Вайнберг, Оппель: SQL. Полное руководство",
      "autor": "Грофф, Вайнберг, Оппель",
      "name": "SQL. Полное руководство",
      "genre": "programming",
      "annotation": "Аннотация к книге \"SQL. Полное руководство\"",
      "description": "Эта книга расскажет вам, как работать с командами и инструкциями SQL, создавать и настраивать реляционные базы данных, загружать и модифицировать объекты баз данных, выполнять мощные запросы, повышать производительность и выстраивать систему безопасности. Вы узнаете, как использовать инструкции DDL и применять API, интегрировать XML и сценарии Java, использовать объекты SQL, создавать веб-серверы, работать с удаленным доступом и выполнять распределенные транзакции. В этой книге вы найдете такие сведения, как описания работы с базами данных в памяти, потоковыми и встраиваемыми базами данных, базами данных для мобильных и наладонных устройств, и многое другое.",
      "fullDescription": "",
      "img": "https://img4.labirint.ru/rc/3fdf0484828f2f18f440e6cac8fdf227/363x561q80/books52/518966/cover.jpg?1645197902",
      "rating": ""
    },
    {
      "id": "12",
      "title": "Меджуи, Уайлд, Митра: Непрерывное развитие API. Правильные решения в изменчивом технологическом ландшафте",
      "autor": "Меджуи, Уайлд, Митра",
      "name": "Непрерывное развитие API",
      "genre": "programming",
      "annotation": "Aннотация к книге \"Непрерывное развитие API. Правильные решения в изменчивом технологическом ландшафте\"",
      "description": "Для реализации API необходимо провести большую работу, но эти усилия не всегда окупаются. Чрезмерное планирование может стать пустой тратой сил, а его недостаток приводит к катастрофическим последствиям. Во втором издании представлены решения для отдельных API и систем из нескольких API, которые позволят вам распределить необходимые ресурсы и достичь требуемого уровня эффективности за оптимальное время. Как соблюсти баланс гибкости и производительности, сохранив надежность и простоту настройки? Четыре эксперта по API объясняют разработчикам, руководителям продуктов и проектов, как максимально увеличить ценность их API, управляя интерфейсами как продуктами с непрерывным жизненным циклом.",
      "fullDescription": "",
      "img": "https://img3.labirint.ru/rc/77328ed3c719410da16383afc784883b/363x561q80/books92/913553/cover.jpg?1669897514",
      "rating": ""
    }
  ]
}
